app/controllers/pages_controller.rb

  def show
  	@page = Page.find(params[:id].to_i)
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)

  def create
	@page = Page.new(params[:page])
	@page.save!
---
INSERT INTO "pages" ("permalink", "created_at", "title", "body", "updated_at") VALUES('about_us', '2011-04-28 06:13:13', 'About Us', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed tristique vehicula dolor, vitae malesuada ligula mattis eget. Suspendisse non feugiat nunc. Duis commodo pharetra magna sed lacinia. Nulla lacinia placerat lorem eget porta. Aliquam bibendum lacus sed nisl gravida et dictum lorem commodo. Morbi ipsum libero, semper nec pulvinar non, interdum eu mi. Nulla gravida vulputate arcu porta eleifend. Duis nunc neque, accumsan eu vehicula a, viverra quis lectus. Donec porttitor molestie nisi, ultricies porta enim vulputate in. Donec augue eros, iaculis ac pretium eu, lacinia sed leo. In hac habitasse platea dictumst. Nunc metus lacus, accumsan quis facilisis eu, dictum in leo. Donec rhoncus dapibus ipsum ac laoreet.