app/controllers/users_controller.rb

	def index
		@users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("created_at", "profile", "updated_at", "username", "hashed_password", "enabled", "last_login_at", "email") VALUES('2011-04-28 06:17:01', 'just chill :)', '2011-04-28 06:17:01', 'amol', '579cad5950a67815feea454631544ac698060d051fca6265790fbc3052090893', 't', NULL, 'chaukadeamol@gmail.com')

	def destroy
		@user = User.find(params[:id])
		if @user.update_attribute(:enabled, false)
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2011-04-28 10:28:22', "enabled" = 'f' WHERE "id" = 1

	def enable
		@user = User.find(params[:id])
		if @user.update_attribute(:enabled, true)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2011-04-28 10:28:24', "enabled" = 't' WHERE "id" = 1